CSI API ETABS v1

# cLoadPatternsAutoSeismic Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cAutoSeismic AutoSeismic { get; }

    ReadOnly Property AutoSeismic As cAutoSeismic
    	Get

    Dim instance As cLoadPatterns
    Dim value As cAutoSeismic

    value = instance.AutoSeismic

    property cAutoSeismic^ AutoSeismic {
    	cAutoSeismic^ get ();
    }

    abstract AutoSeismic : cAutoSeismic with get

#### Property Value

Type: cAutoSeismic

See Also

#### Reference

cLoadPatterns Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com